In [3]:
import numpy as np
import pandas as pd

In [9]:
d={'CarId':[100,101,102,104,105],
   'CarName':['alto','nexon','scorpio','fortuner','range rover'],
  }

In [10]:
std=pd.DataFrame(d)

In [13]:
std

   CarId      CarName
0    100         alto
1    101        nexon
2    102      scorpio
3    104     fortuner
4    105  range rover

In [14]:
d={'StudentName':['simran','garvit','nitish','pooja','dhrupada'],
   'StudentMarks':[82,85,86,81,80],
  }

In [15]:
df=pd.DataFrame(d)

In [16]:
df

  StudentName  StudentMarks
0      simran            82
1      garvit            85
2      nitish            86
3       pooja            81
4    dhrupada            80

In [22]:
d1={'StudentName':['simran','garvit','nitish','pooja','dhrupada'],
   'StudentUsn':[10,12,14,16,18],
  }

In [23]:
df1=pd.DataFrame(d1)

In [24]:
df1

  StudentName  StudentUsn
0      simran          10
1      garvit          12
2      nitish          14
3       pooja          16
4    dhrupada          18

In [30]:
d2={'StudentMarks':[82],
   'StudentUsn':[10],
   }

In [31]:
df2=pd.DataFrame(d2)

In [32]:
df2

   StudentMarks  StudentUsn
0            82          10

In [33]:
pd.merge(df1,df2,how='left',on='StudentUsn')

  StudentName  StudentUsn  StudentMarks
0      simran          10          82.0
1      garvit          12           NaN
2      nitish          14           NaN
3       pooja          16           NaN
4    dhrupada          18           NaN